In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('carprices.csv')
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [4]:
dummies = pd.get_dummies(df['Car Model'])
dummies

    Audi A5  BMW X5  Mercedez Benz C class
0         0       1                      0
1         0       1                      0
2         0       1                      0
3         0       1                      0
4         0       1                      0
5         1       0                      0
6         1       0                      0
7         1       0                      0
8         1       0                      0
9         0       0                      1
10        0       0                      1
11        0       0                      1
12        0       0                      1

In [5]:
df = pd.concat([dummies, df], axis='columns')
df

,Audi A5,BMW X5,Mercedez Benz C class,Car Model,Mileage,Sell Price($),Age(yrs)
0,0,1,0,BMW X5,69000,18000,6
1,0,1,0,BMW X5,35000,34000,3
2,0,1,0,BMW X5,57000,26100,5
3,0,1,0,BMW X5,22500,40000,2
4,0,1,0,BMW X5,46000,31500,4
5,1,0,0,Audi A5,59000,29400,5
6,1,0,0,Audi A5,52000,32000,5
7,1,0,0,Audi A5,72000,19300,6
8,1,0,0,Audi A5,91000,12000,8
9,0,0,1,Mercedez Benz C class,67000,22000,6
10,0,0,1,Mercedez Benz C class,83000,20000,7
11,0,0,1,Mercedez Benz C class,79000,21000,7
12,0,0,1,Mercedez Benz C class,59000,33000,5

In [7]:
df = df.drop(['Car Model'], axis='columns')
df

    Audi A5  BMW X5  Mercedez Benz C class  Mileage  Sell Price($)  Age(yrs)
0         0       1                      0    69000          18000         6
1         0       1                      0    35000          34000         3
2         0       1                      0    57000          26100         5
3         0       1                      0    22500          40000         2
4         0       1                      0    46000          31500         4
5         1       0                      0    59000          29400         5
6         1       0                      0    52000          32000         5
7         1       0                      0    72000          19300         6
8         1       0                      0    91000          12000         8
9         0       0                      1    67000          22000         6
10        0       0                      1    83000          20000         7
11        0       0                      1    79000          21000         7
12        0       0                      1    59000          33000         5

In [10]:
x = df[['Audi A5', 'BMW X5', 'Mercedez Benz C class', 'Mileage', 'Age(yrs)'
]]
x

    Audi A5  BMW X5  Mercedez Benz C class  Mileage  Age(yrs)
0         0       1                      0    69000         6
1         0       1                      0    35000         3
2         0       1                      0    57000         5
3         0       1                      0    22500         2
4         0       1                      0    46000         4
5         1       0                      0    59000         5
6         1       0                      0    52000         5
7         1       0                      0    72000         6
8         1       0                      0    91000         8
9         0       0                      1    67000         6
10        0       0                      1    83000         7
11        0       0                      1    79000         7
12        0       0                      1    59000         5

In [11]:
y = df['Sell Price($)']
y

0     18000
1     34000
2     26100
3     40000
4     31500
5     29400
6     32000
7     19300
8     12000
9     22000
10    20000
11    21000
12    33000
Name: Sell Price($), dtype: int64

In [12]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder

In [13]:
ct = ColumnTransformer([('ohe', OneHotEncoder(categories='auto'), [0])], remainder='passthrough')

In [15]:
x = ct.fit_transform(x)
x

array([[1.00e+00, 0.00e+00, 1.00e+00, 0.00e+00, 6.90e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 1.00e+00, 0.00e+00, 3.50e+04, 3.00e+00],
       [1.00e+00, 0.00e+00, 1.00e+00, 0.00e+00, 5.70e+04, 5.00e+00],
       [1.00e+00, 0.00e+00, 1.00e+00, 0.00e+00, 2.25e+04, 2.00e+00],
       [1.00e+00, 0.00e+00, 1.00e+00, 0.00e+00, 4.60e+04, 4.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 0.00e+00, 5.90e+04, 5.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 0.00e+00, 5.20e+04, 5.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 0.00e+00, 7.20e+04, 6.00e+00],
       [0.00e+00, 1.00e+00, 0.00e+00, 0.00e+00, 9.10e+04, 8.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 1.00e+00, 6.70e+04, 6.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 1.00e+00, 8.30e+04, 7.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 1.00e+00, 7.90e+04, 7.00e+00],
       [1.00e+00, 0.00e+00, 0.00e+00, 1.00e+00, 5.90e+04, 5.00e+00]])

In [16]:
from sklearn.model_selection import train_test_split
(xtrain, xtest, ytrain, ytest) = train_test_split(x, y, test_size=0.25, random_state=1)

In [17]:
xtrain

array([[1.0e+00, 0.0e+00, 1.0e+00, 0.0e+00, 3.5e+04, 3.0e+00],
       [0.0e+00, 1.0e+00, 0.0e+00, 0.0e+00, 5.2e+04, 5.0e+00],
       [1.0e+00, 0.0e+00, 1.0e+00, 0.0e+00, 6.9e+04, 6.0e+00],
       [0.0e+00, 1.0e+00, 0.0e+00, 0.0e+00, 7.2e+04, 6.0e+00],
       [1.0e+00, 0.0e+00, 0.0e+00, 1.0e+00, 5.9e+04, 5.0e+00],
       [1.0e+00, 0.0e+00, 0.0e+00, 1.0e+00, 6.7e+04, 6.0e+00],
       [0.0e+00, 1.0e+00, 0.0e+00, 0.0e+00, 9.1e+04, 8.0e+00],
       [1.0e+00, 0.0e+00, 0.0e+00, 1.0e+00, 7.9e+04, 7.0e+00],
       [0.0e+00, 1.0e+00, 0.0e+00, 0.0e+00, 5.9e+04, 5.0e+00]])

In [18]:
ytrain

1     34000
6     32000
0     18000
7     19300
12    33000
9     22000
8     12000
11    21000
5     29400
Name: Sell Price($), dtype: int64

In [19]:
from sklearn.linear_model import LinearRegression
reg = LinearRegression()

In [20]:
reg.fit(xtrain, ytrain)

LinearRegression()

In [21]:
reg.predict(xtest)

array([23361.78247734, 41161.70694864, 29076.13293051, 18013.29305136])

In [22]:
reg.coef_

array([-7.32235650e+02,  7.32235650e+02, -4.28205438e+03,  3.54981873e+03,
       -4.37915408e-01, -8.97280967e+02])

In [23]:
reg.intercept_

57823.655589127695

In [26]:
reg.score(xtrain, ytrain)

0.9324571133322055

In [27]:
reg.score(xtest, ytest)

0.913574973121725

In [28]:
import joblib as jl

In [29]:
jl.dump(reg, 'ohe')

['ohe']

In [32]:
ohe = jl.load('ohe')

In [34]:
ohe.coef_

array([-7.32235650e+02,  7.32235650e+02, -4.28205438e+03,  3.54981873e+03,
       -4.37915408e-01, -8.97280967e+02])